Tekla.Structures.DirectManipulation.Adapter.State.Native.dotComponentType
The different TS component types. Matches defines in
Core\TeklaStructures\libcommands\interface\e3_commands_types.h.

Tekla.Structures.DirectManipulation.Adapter.State.Native.dotComponentType.Unknown
Component type is unknown or not set.

Tekla.Structures.DirectManipulation.Adapter.State.Native.dotComponentType.CustomJoint
A user defined custom component that is a joint.

Tekla.Structures.DirectManipulation.Adapter.State.Native.dotComponentType.CustomDetail
A user defined custom component that is a detail.

Tekla.Structures.DirectManipulation.Adapter.State.Native.dotComponentType.CustomSeam
A user defined custom component that is a seam.

Tekla.Structures.DirectManipulation.Adapter.State.Native.dotComponentType.CustomPart
A user defined custom component that is a part.

Tekla.Structures.DirectManipulation.Adapter.State.Native.dotComponentType.CustomUnknownType
A user defined custom component that is of an unknown subtype.

Tekla.Structures.DirectManipulation.Adapter.State.Native.dotComponentType.DotnetJoint
A .net plugin that is a joint.

Tekla.Structures.DirectManipulation.Adapter.State.Native.dotComponentType.DotnetPlugin
A .net plugin (non-joint).

Tekla.Structures.DirectManipulation.Adapter.State.Native.dotComponentType.SystemMacro
A system macro.

Tekla.Structures.DirectManipulation.Adapter.State.Native.dotComponentType.SystemJoint
A system joint.

Tekla.Structures.DirectManipulation.Adapter.State.Native.dotComponentType.SystemDetail
A system detail.